**Sprint 8 - Proyecto**
Paso 4. Análisis exploratorio de datos (Python)

Además de los datos que recuperaste en las tareas anteriores te han dado un segundo archivo. Ahora tienes estos dos CSV:

https://practicum-content.s3.us-west-1.amazonaws.com/learning-materials/data-analyst-eng/moved_project_sql_result_01.csv
/datasets/project_sql_result_01.csv. contiene los siguientes datos:

company_name: nombre de la empresa de taxis

trips_amount: el número de viajes de cada compañía de taxis el 15 y 16 de noviembre de 2017. 

https://practicum-content.s3.us-west-1.amazonaws.com/learning-materials/data-analyst-eng/moved_project_sql_result_04.csv
/datasets/project_sql_result_04.csv. contiene los siguientes datos:

dropoff_location_name: barrios de Chicago donde finalizaron los viajes

average_trips: el promedio de viajes que terminaron en cada barrio en noviembre de 2017.

**Para estos dos datasets ahora necesitas**

- importar los archivos
- estudiar los datos que contienen
asegurarte de que los tipos de datos sean correctos
identificar los 10 principales barrios en términos de finalización del recorrido
hacer gráficos: empresas de taxis y número de viajes, los 10 barrios principales por número de finalizaciones
sacar conclusiones basadas en cada gráfico y explicar los resultados

In [2]:
# Import libraries
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt

In [20]:
# Crear datasets

company_trips = pd.read_csv('https://practicum-content.s3.us-west-1.amazonaws.com/learning-materials/data-analyst-eng/moved_project_sql_result_01.csv')
company_trips.sample(10)

                                 company_name  trips_amount
51                       4623 - 27290 Jay Kim            15
34                               Norshore Cab           127
38                    6743 - 78771 Luhak Corp            33
8                   Star North Management LLC          7455
4             Taxi Affiliation Service Yellow          9299
5                   Chicago Carriage Cab Corp          9181
12                  Dispatch Taxi Affiliation          3355
45                  3011 - 66308 JBL Cab Inc.            25
62  2241 - 44667 - Felman Corp, Manuel Alonso             3
42                1085 - 72312 N and W Cab Co            29

In [17]:
company_trips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 64 entries, 0 to 63
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   company_name  64 non-null     object
 1   trips_amount  64 non-null     int64
dtypes: int64(1), object(1)
memory usage: 1.1+ KB

In [19]:
# Crear datasets
chicago = pd.read_csv('https://practicum-content.s3.us-west-1.amazonaws.com/learning-materials/data-analyst-eng/moved_project_sql_result_04.csv')
chicago.sample(10)

   dropoff_location_name  average_trips
72         South Chicago      13.000000
42         Garfield Park      65.766667
57               Hermosa      27.566667
77        Archer Heights       8.366667
86           West Elsdon       5.666667
71           Edison Park      14.166667
29           Albany Park     180.900000
81           Morgan Park       7.700000
7          Museum Campus    1510.000000
68              Clearing      14.500000

In [ ]:
chicago.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 94 entries, 0 to 93
Data columns (total 2 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   dropoff_location_name  94 non-null     object
 1   average_trips          94 non-null     float64
dtypes: float64(1), object(1)
memory usage: 1.6+ KB

**identificar los 10 principales barrios en términos de finalización del recorrido**

In [35]:
chicago_grouped = chicago.groupby('dropoff_location_name')['average_trips'].sum().reset_index()
chicago_top10 = chicago_grouped.sort_values(by='average_trips', ascending = False).head(10)
chicago_top10

   dropoff_location_name  average_trips
50                  Loop   10727.466667
68           River North    9523.666667
78         Streeterville    6664.666667
87             West Loop    5163.666667
63                O'Hare    2546.900000
44             Lake View    2420.966667
35            Grant Park    2068.533333
56         Museum Campus    1510.000000
32            Gold Coast    1364.233333
74    Sheffield & DePaul    1259.766667

In [38]:
top_10_list = chicago_top10.dropoff_location_name.to_list()
top_10_list

['Loop',
 'River North',
 'Streeterville',
 'West Loop',
 "O'Hare",
 'Lake View',
 'Grant Park',
 'Museum Campus',
 'Gold Coast',
 'Sheffield & DePaul']